Revit 2024 API
SymbolicCurve.GetVisibility Method
Gets the visibility for the symbolic curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FamilyElementVisibility GetVisibility()
Visual Basic
Public Function GetVisibility As FamilyElementVisibility
Visual C++
public:
FamilyElementVisibility^ GetVisibility()
Return Value
A copy of visibility settings for the symbolic curve.
See Also
SymbolicCurve Class
Autodesk.Revit.DB Namespace